paypal-core/test-data/payment-approved.json

{
  "id": "PAY-6MT6019334734810GLP2QJOI",
  "intent": "sale",
  "state": "approved",
  "cart": "7H166117V65459919",
  "payer": {
    "status": "VERIFIED",
    "payment_method": "paypal",
    "payer_info": {
      "email": "test-buyer@acme.com",
      "first_name": "test",
      "last_name": "buyer",
      "payer_id": "9KV4FWVA79N94",
      "country_code": "DE"
    }
  },
  "transactions": [
    {
      "amount": {
        "currency": "EUR",
        "details": {
          "tax": "0.00",
          "subtotal": "29.99"
        },
        "total": "29.99"
      },
      "description": "Merlin Online Solutions",
      "payee": {
        "email": "admin-facilitator@acme.de",
        "merchant_id": "LKHIUL76E"
      },
      "item_list": {
        "items": [
          {
            "name": "Elections 2019",
            "quantity": "1",
            "price": "29.99",
            "tax": "0.00",
            "currency": "EUR"
          }
        ]
      },
      "related_resources": [
        {
          "sale": {
            "id": "7L434776S1839983G",
            "state": "completed",
            "amount": {
              "currency": "EUR",
              "details": {
                "subtotal": "29.99"
              },
              "total": "29.99"
            },
            "links": [
              {
                "href": "https://api.sandbox.paypal.com/v1/payments/sale/7L434776S1839983G",
                "rel": "self",
                "method": "GET"
              },
              {
                "href": "https://api.sandbox.paypal.com/v1/payments/sale/7L434776S1839983G/refund",
                "rel": "refund",
                "method": "POST"
              },
              {
                "href": "https://api.sandbox.paypal.com/v1/payments/payment/PAY-6MT6019334734810GLP2QJOI",
                "rel": "parent_payment",
                "method": "GET"
              }
            ],
            "payment_mode": "INSTANT_TRANSFER",
            "protection_eligibility": "ELIGIBLE",
            "protection_eligibility_type": "ITEM_NOT_RECEIVED_ELIGIBLE,UNAUTHORIZED_PAYMENT_ELIGIBLE",
            "parent_payment": "PAY-6MT6019334734810GLP2QJOI",
            "create_time": "2018-11-21T07:10:03Z",
            "update_time": "2018-11-21T07:10:03Z",
            "transaction_fee": {
              "value": "0.92",
              "currency": "EUR"
            }
          }
        }
      ]
    }
  ],
  "links": [
    {
      "href": "https://api.sandbox.paypal.com/v1/payments/payment/PAY-6MT6019334734810GLP2QJOI",
      "rel": "self",
      "method": "GET"
    }
  ],
  "create_time": "2018-11-21T07:10:04Z"
}